1s/ERP/Conf/AccumulationRegisters/Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ТоварыКПоступлениюПоПредзаказамПоставщику</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ТоварыКПоступлениюПоПредзаказамПоставщику/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс 

Процедура Проведение(ДокументОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументОбъект.Движения.Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.Записывать = Истина;
	Движения = Неопределено;
	ПолучитьДвиженияПоДокументу(ДокументОбъект.Ссылка, Движения); 
	
	ПроверкаНаОшибки(Движения, ДокументОбъект);
	
	ДокументОбъект.Движения.Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.Загрузить(Движения);
	
КонецПроцедуры 


Процедура СформироватьДвижения(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыНакопления.Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Движения = Новый ТаблицаЗначений;
	ПолучитьДвиженияПоДокументу(ДокументСсылка, Движения);
	
	ПроверкаНаОшибки(Движения, ДокументСсылка);

	
	НаборЗаписей.Загрузить(Движения);
	
	НаборЗаписей.Записать(Истина); 	
	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Процедура ПолучитьДвиженияПоДокументу(Ссылка, Движения)
	
	ПолучитьДвиженияПоДокументуЗаказПоставщику(Ссылка, Движения);
	ПолучитьДвиженияПоДокументуПриходныйОрдер(Ссылка, Движения);
	ПолучитьДвиженияПоДокументПриобретениеТоваровИУслуг(Ссылка, Движения);
	
КонецПроцедуры 


Процедура ПолучитьДвиженияПоДокументуЗаказПоставщику(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Приход) КАК ВидДвижения,
	|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Ссылка.ПоступлениеОднойДатой
	|			ТОГДА ЗаказПоставщикуТовары.Ссылка.ДатаОтгрузки
	|		ИНАЧЕ ЗаказПоставщикуТовары.ДатаОтгрузки
	|	КОНЕЦ КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|	И ЗаказПоставщикуТовары.Ссылка.Лико_Предзаказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Ссылка.Дата,
	|	ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Ссылка.ПоступлениеОднойДатой
	|			ТОГДА ЗаказПоставщикуТовары.Ссылка.ДатаОтгрузки
	|		ИНАЧЕ ЗаказПоставщикуТовары.ДатаОтгрузки
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВтТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВтТовары.Период
	|		ИНАЧЕ ВтТовары.ДатаОтгрузки
	|	КОНЕЦ КАК Период,
	|	ВтТовары.ВидДвижения КАК ВидДвижения,
	|	ВтТовары.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВтТовары.Номенклатура КАК Номенклатура,
	|	ВтТовары.Характеристика КАК Характеристика,
	|	ВтТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВтТовары.Количество КАК Количество,
	|	ВтТовары.ДатаОтгрузки КАК ДатаОтгрузки
	|ИЗ
	|	ВтТовары КАК ВтТовары";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 

Процедура ПолучитьДвиженияПоДокументуПриходныйОрдер(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Расход) КАК ВидДвижения,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение.Лико_Основание КАК ЗаказПоставщику,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	|	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ПриходныйОрдерНаТоварыТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение.Лико_Основание.Лико_Предзаказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура,
	|	ПриходныйОрдерНаТоварыТовары.Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура.ЕдиницаИзмерения,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение.Лико_Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Расход),
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура,
	|	ПриходныйОрдерНаТоварыТовары.Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ПриходныйОрдерНаТоварыТовары.Количество)
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение.Лико_Предзаказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура,
	|	ПриходныйОрдерНаТоварыТовары.Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура.ЕдиницаИзмерения,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 

Процедура ПолучитьДвиженияПоДокументПриобретениеТоваровИУслуг(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Расход) КАК ВидДвижения,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество,
	|	ПриобретениеТоваровУслугТовары.ЗаказПоставщику.Лико_Основание КАК ЗаказПоставщику
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
	|	И ПриобретениеТоваровУслугТовары.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И НЕ ПриобретениеТоваровУслугТовары.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|	И ПриобретениеТоваровУслугТовары.ЗаказПоставщику.Лико_Основание.Лико_Предзаказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ПриобретениеТоваровУслугТовары.Ссылка.Дата,
	|	ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения,
	|	ПриобретениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПриобретениеТоваровУслугТовары.ЗаказПоставщику.Лико_Основание";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 




Процедура ПроверкаНаОшибки(Движения, Документ)
	
	Если Движения = Неопределено Тогда
		
		ВызватьИсключение(СтрШаблон("Документ: %1 не может отражать движения по регистру:""лк Товары к поступлению по заказам поставщику""!",Документ)) ;
		
	КонецЕсли;
	
 КонецПроцедуры
 
 

#КонецОбласти

#КонецЕсли
